[
  {
    "title": "simple",
    "description": "A component based static site generator written in rust. I wrote it to make this website.",
    "link": "Tnixc/simple",
    "tags": "rust/cli"
  },
  {
    "title": "Toki",
    "description": "A simple time tracking app for macOS, written with swiftUI. Reminds you to clock out, take breaks etc.",
    "link": "Tnixc/Toki",
    "tags": "swift[WIP]"
  },
  {
    "title": "ZCore",
    "description": "A basic assembly parser and cpu 'emulator' with 256 bytes of ram and instructions, 8 registers. Written in zig, very much WIP",
    "link": "Tnixc/ZCore",
    "tags": "zig[WIP]"
  },
  {
    "title": "lightscrape-rs",
    "description": "A cli that asynchronously downloads websites that host light novels from a given url, parses it, and compiles it into an epub. It's written in rust and I wrote it because I wanted to read webnovels offline",
    "link": "Tnixc/lightscrape-rs",
    "tags": "rust/cli"
  },
  {
    "title": "tnixc.space",
    "description": "This very website. There's been lots of editions since the first one. There's a blog post covering all of them [here](/content/history.html).",
    "link": "Tnixc/website-v6",
    "tags": "rust/cli"
  },
  {
    "title": "edo",
    "description": "A color theme based off of the foreground colors of tokyo-night and the background color of catppuccin macchiato. I made it because I found catppuccin macchiato too desaturated. It mainly consists of catppuccin themes that I used replacer on to replace the hex codes.",
    "link": "Tnixc/edo",
    "tags": "theme"
  },
  {
    "title": "replacer",
    "description": "A nice and simple cli that reads a toml file of pairs and recursively goes through every file, I wrote it for the purpose of generathing themes for tokyo.",
    "link": "Tnixc/replacer",
    "tags": "rust/cli"
  },
  {
    "title": "nix-config/dotfiles",
    "description": "My dotfiles for my macOS setup, with nix-darwin and home-manager. Pretty simple stuff.",
    "link": "Tnixc/nix-config",
    "tags": "nix"
  }
]
